[LANG]
language=French (France)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Erreur de syntaxe SQL
200002=Fichier introuvable
200003=Fichier corrompu
200004=Erreur de paramètre
200026=Nom de table déjà existant
200027=Nom de table introuvable
200028=Erreur d'importation du fichier CSV, échec de la génération du SQL, veuillez vérifier le contenu du fichier CSV et la configuration
300001=Aucune colonne de table sélectionnée pour créer un index
300002=La requête SQL ne peut pas être vide
300003=L'analyse SQL ne prend en charge que les requêtes SELECT
[STRING]
home=Accueil
database=Base de données
analysis=Analyse
view=Vue
setting=Paramètres
items=enregistrements
tables=Tables
views=Vues
triggers=Déclencheurs
columns=Colonnes
indexes=Index
table=Table
clear-all=Tout effacer
yes=Oui
no=Non
welcome-text=Bienvenue sur CuteSqlite
home-text1=CuteSqlite est un outil client graphique (GUI) pour Sqlite3.
home-text2=Il vous permet de concevoir, créer et parcourir des bases de données, gérer les objets de base de données,
home-text3=d'insérer des données, ainsi que de concevoir et exécuter des requêtes SQL pour traiter les données stockées.
home-text4=Vous pouvez également migrer des bases de données et des données d'autres fournisseurs de bases de données vers une base de données Sqlite.
db-section-text=Base de données Sqlite
analysis-text1=CuteSqlite vous permet d'analyser et d'optimiser les performances des requêtes SQL.
analysis-text2=Il vous permet également d'analyser la capacité de stockage de chaque table dans la base de données,
analysis-text3=ainsi que de configurer les paramètres de la base de données pour l'optimiser.
perf-analysis-section-text=Analyse des performances
error-text=Erreur système :
create-database=Créer une base de données (Ctrl+N)
open-database=Ouvrir une base de données (Ctrl+O)
refresh-database=Actualiser la base de données (F5)
delete-database=Supprimer la BDD sélectionnée de la liste (Del)
override-user-db=Les données du fichier supprimé ne peuvent pas être récupérées. Confirmer l'écrasement de la base de données ?
create-db-success-text=Base de données créée avec succès
open-db-exists-inlist=La base de données est déjà ouverte, veuillez ne pas répéter l'opération
open-db-success-text=Base de données ouverte avec succès
delete-user-db=Confirmer la suppression de la base de données "{dbName}" de la liste ?
delete-db-success-text=Base de données supprimée de la liste avec succès
query-editor=Éditeur de requêtes
history=Historique
history-tip=Historique (F8)
result-list=Résultats
result-info=Informations
result-table-data=Données de la table
table-properties=Propriétés de la table
exec-select-sql=Exécuter la requête sélectionnée (F9)
exec-all-sql=Exécuter toutes les requêtes (F10)
explain-select-sql=Explain la requête SQL sélectionnée (F11)
explain-query-plan-sql=Explain query plan la requête SQL sélectionnée (F12)
query-page-help=Fonction de saisie automatique : [Tab] -> onglet suivant ; [Ctrl+Espace] -> lister les correspondances ; [Ctrl+Entrée] -> lister tous les tags
no-select-userdb=Aucune base de données sélectionnée
no-sql-statement=L'éditeur de requêtes ne contient aucune requête SQL
no-sql-content=L'éditeur de requêtes ne contient aucune instruction SQL
show-form-view=Afficher la vue formulaire
export-result-as=Exporter sous... (Ctrl+Alt+E)
copy-result-data=Copier les données dans le presse-papiers
clear-all=Tout effacer
ok=OK
cancel=Annuler
export-text-description=Choisissez le format d'exportation des données
csv-settings=Options CSV
csv-field-settings=Colonnes
csv-line-settings=Lignes
csv-charset-settings=Jeu de caractères
excel-settings=Options Excel
sql-settings=Options SQL
export-fields-settings=Sélectionnez les colonnes à exporter
terminated-by=Séparateur
enclosed-by=Encadreur
escaped-by=Caractère d'échappement
field-terminated-by=Séparateur de colonnes
field-enclosed-by=Encadreur de colonnes
field-escaped-by=Caractère d'échappement de colonnes
line-terminated-by=Séparateur de lignes
add-column-name=Ajouter les noms de colonnes en en-tête
csv-charset=Jeu de caractères
excel-column-max-size=Taille limite des colonnes de texte
excel-decinmal-places=Décimales
structure-only=Structure uniquement
data-only=Données uniquement
structure-and-data=Structure et données
select-all=Tout sélectionner
deselect-all=Tout désélectionner
save-to-file=Enregistrer dans un fichier
expert-fmt-error=Veuillez sélectionner le format de fichier pour l'exportation des données
terminated-by-error=Veuillez saisir la valeur pour "Séparateur"
enclosed-by-error=Veuillez saisir la valeur pour "Encadreur"
escaped-by-error=Veuillez saisir la valeur pour "Caractère d'échappement"
line-terminated-by-error=La valeur du "Séparateur de lignes" est incorrecte
excel-column-max-size-error=Veuillez saisir la valeur pour "Taille limite des colonnes de texte"
excel-decinmal-places-error=Veuillez saisir la valeur pour "Décimales"
export-sql-error=Veuillez sélectionner les options SQL
selected-fields-error=Veuillez sélectionner les colonnes à exporter
export-path-error=Veuillez saisir le chemin du fichier d'exportation
sql-notsupport-multitable-query-error=L'exportation des résultats de requêtes multi-tables et de sous-requêtes n'est pas prise en charge
export-success-text=Exportation réussie, {rows} lignes de données ont été exportées. Ouvrir le fichier ?
open-the-file=Ouvrir le fichier
export-file-exists-prompt={export-path} existe déjà. Remplacer ?
limit-rows=Limite de lignes
offset=Ligne de début
rows=Nombre de lignes
copy-all-rows-to-clipboard=Copier toutes les lignes dans le presse-papiers Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copier les lignes sélectionnées dans le presse-papiers Ctrl+Alt+H
copy-all-rows-as-sql=Copier toutes les lignes en SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Copier les lignes sélectionnées en SQL Ctrl+Alt+K
read-only=Lecture seule
filter=Filtre (Ctrl+Alt+F)
filter-in-use=Filtre en cours d'utilisation
refresh=Actualiser (Ctrl+F5)
refresh-page=Actualiser
new-row-tip=Nouvelle ligne (Ctrl+Alt+N)
copy-row-tip=Copier la ligne (Ctrl+Alt+C)
save-tip=Enregistrer (Ctrl+Alt+S)
delete-tip=Supprimer la ligne sélectionnée (Ctrl+Suppr)
cancel-tip=Annuler les modifications (Ctrl+Alt+Z)
revert-tip=Rétablir
save=Enregistrer
revert=Annuler les modifications
column=Nom de la colonne
condition=Condition
value=Valeur
delete-confirm-text=Confirmer la suppression des lignes sélectionnées ?
query=Requête
result=Résultat
affected-rows=Lignes affectées
exec-time=Temps d'exécution
transfer-time=Temps de transfert
total-time=Temps total
database-create=Créer une BDD Ctrl+N
database-open=Ouvrir une BDD Ctrl+O
database-refresh=Actualiser la BDD Ctrl+R
database-delete=Supprimer la BDD Suppr
database-copy=Copier la BDD sous... Ctrl+P
database-export-as-sql=Exporter la BDD en SQL Ctrl+E
database-import-from-sql=Importer SQL dans la BDD Ctrl+I
database-new=Créer
database-new-table=Table
database-new-view=Vue
database-new-trigger=Déclencheur
export-as-sql-text-description=Exporter les tables/vues/déclencheurs de la BDD sélectionnée en SQL
select-database=Base de données sélectionnée
database-objects=Objets
structure-and-data-settings=Paramètres de structure et de données
insert-statement-settings=Paramètres de l'instruction INSERT
tbl-statement-settings=Paramètres des instructions de table
retain-column-text=Conserver les noms de colonnes dans "Insert Into"
contain-multi-rows-text=Chaque instruction "Insert" contient plusieurs lignes (VALUES)
retain-table-text=Conserver l'ancienne table (Create Table If Not Exists ...)
override-table-text=Remplacer l'ancienne table (DROP TABLE, puis CREATE TABLE)
import-from-sql-text-description=Exécution par lots des instructions dans le fichier SQL.
abort-on-error-text=Arrêter en cas d'erreur.
import-file-not-exists=Le fichier SQL à importer n'existe pas, veuillez en sélectionner un autre.
import-path-empty-error=Le chemin du fichier d'importation ne peut pas être vide.
import=Importer
export=Exporter
tbl-name=Nom de la table
new-table=Créer une table
new-view=Créer une vue
new-trigger=Créer un déclencheur
database=Base de données
schema=Schéma
table-columns=Colonnes
table-indexes=Index
table-foreignkeys=Clés étrangères
column-name=Nom de la colonne
data-type=Type de données
default=Défaut
check=Contrainte
index-name=Nom de l'index
index-type=Type d'index
index-unique=Unique
partial-clause=Clause partielle
comments=Commentaires
to-be-selected=Colonnes disponibles
selected=Sélectionnées
up=▲
down=▼
no-columns-selected=Aucune colonne sélectionnée, veuillez en sélectionner
sql-preview=Aperçu SQL
tbl-name-empty=Le nom de la table ne peut pas être vide
tbl-name-duplicated=Le nom de la table existe déjà
create-table-success-text=Table créée avec succès.
alter-table-success-text=Table modifiée avec succès.
rename-table-success-text=Nom de la table modifié avec succès.
delete-column-confirm-text=La colonne sélectionnée est référencée par un ou plusieurs index. La suppression de cette colonne modifiera également les index correspondants. Confirmer la suppression ?
delete-index-confirm-text=L'index sélectionné est référencé par une ou plusieurs colonnes. La suppression de cet index modifiera également les colonnes correspondantes. Confirmer la suppression ?
delete-confirm-text=Confirmer la suppression ?
new-view=Créer une vue
new-trigger=Créer un déclencheur
create-a-view-name=Nom de la nouvelle vue
view-name-not-empty=Le nom de la nouvelle vue ne peut pas être vide
view-name-duplicated=Le nom de la vue existe déjà
create-a-trigger-name=Nom du déclencheur
trigger-name-not-empty=Le nom du déclencheur ne peut pas être vide
trigger-name-duplicated=Le nom du déclencheur existe déjà
execute-sql-success=SQL exécuté avec succès
copy-db-success-text=Base de données copiée avec succès
table-open=Ouvrir les données de la table Alt+O
table-create=Créer une table Alt+N
table-alter=Modifier la table Alt+A
table-rename=Renommer la table Alt+M
table-truncate=Vider la table Alt+T
table-drop=Supprimer la table Alt+Suppr
table-copy-as=Copier la table vers... Alt+P
table-sharding-as=Partitionnement Alt+G
table-export=Exporter la table vers... Alt+E
table-import-sql=Importer depuis un fichier SQL Alt+I
table-import-csv=Importer depuis un fichier CSV Alt+J
table-manage-index=Gérer les index de la table
table-manage-foreign-key=Gérer les clés étrangères de la table
properties=Propriétés
primary-key-duplicated=La clé primaire est définie plusieurs fois.
foreignkey-name=Nom de la clé étrangère
referencing-columns=Colonnes de cette table
referenced-table=Table référencée
referenced-columns=Colonnes référencées
on-update=En cas de mise à jour
on-delete=En cas de suppression
insert-new-column=Ajouter une nouvelle colonne
insert-new-index=Ajouter un nouvel index
insert-new-foreignkey=Ajouter une nouvelle clé étrangère
insert-del-column=Supprimer la colonne sélectionnée
insert-del-index=Supprimer l'index sélectionné
insert-del-foreignkey=Supprimer la clé étrangère sélectionnée
select-referenced-table-first=Veuillez d'abord sélectionner la table référencée
new-table-name=Nouveau nom de table
table-name-not-empty=Le nouveau nom de table ne peut pas être vide
table-name-duplicated=Le nouveau nom de table existe déjà
ai-column-exists=Une colonne AUTOINCREMENT existe déjà.
ai-fobidden-multi-pk=Une colonne AUTOINCREMENT existe déjà, plusieurs clés primaires ne sont pas autorisées.
ai-column-must-integer=La colonne AUTOINCREMENT doit être de type INTEGER.
truncate-table-confirm-text=Après avoir vidé la table, les données ne peuvent pas être récupérées. Confirmer le vidage ?
truncate-table-success-text=Les données de la table ont été vidées avec succès
drop-table-confirm-text=Après avoir supprimé la table, les données ne peuvent pas être récupérées. Confirmer la suppression ?
drop-table-success-text=Table supprimée avec succès
copy-table-text-description=Configuration des paramètres de copie, prend en charge le partitionnement des tables
from-db-name=Base de données source
from-tbl-name=Table source
to-db-name=Base de données cible
to-tbl-name=Table cible
table-sharding-setttings=Partitionnement de la table
enable-table-sharding=Activer le partitionnement de la table
table-suffix-begin={suffix} Entier de début
table-suffix-end={suffix} Entier de fin
advanced-settings=Options avancées de partitionnement
enable-copy-data-with-strategy=Activer la stratégie de copie des données vers les tables partitionnées
sharding-strategy-express-text=Expression de la stratégie de partitionnement : {n}
preview-sql=Aperçu de la requête SQL
structure-and-data-settings-unknown=Paramètres de structure et de données non sélectionnés
table-suffix-error=Entier de partitionnement invalide, veuillez saisir une valeur correcte
target-table-name-no-n=La table cible doit contenir la chaîne "{n}".
sharding-strategy-express-empty=L'expression de la stratégie de partitionnement ne peut pas être vide
copy-table-success-text=Table copiée avec succès.
start=Démarrer
complete=Terminé
express-title=Expression de la stratégie de partitionnement de table
functions=Fonctions
express-editor-help=Expression - double-cliquez sur une fonction ou un champ pour l'insérer dans l'éditeur
import-from-csv-text-description=Configuration pour l'importation de données à partir d'un fichier CSV
source-csv-file=Chemin du fichier CSV source
target-database=Base de données cible
target-table=Table cible
columns-setttings=Colonnes
csv-data=Données CSV
column-name-on-top=Première ligne comme noms de colonnes
line-terminated-by=Séparateur de lignes
csv-null-as-keyword=null/NULL comme mot-clé SQL
encoding=Encodage
import-success-text=Importation réussie
incorrect-sql-statement=Requête SQL incorrecte
import-error-text=Erreur d'importation
table-manage-columns=Gérer les colonnes
table-drop-column=Supprimer la colonne
table-manage-indexes=Gérer les index
table-drop-index=Supprimer l'index
create-view=Créer une nouvelle vue
open-view=Ouvrir la vue
drop-view=Supprimer la vue
create-trigger=Créer un déclencheur
open-trigger=Ouvrir le déclencheur
drop-trigger=Supprimer le déclencheur
drop-view-confirm-text=Après la suppression, la vue ne peut pas être récupérée. Confirmer la suppression ?
drop-view-success-text=Vue supprimée avec succès
drop-trigger-confirm-text=Après la suppression, le déclencheur ne peut pas être récupéré. Confirmer la suppression ?
drop-trigger-success-text=Déclencheur supprimé avec succès
sql-templates=Modèles de requêtes SQL
pragma-templates=Pragmas
sql-log=Historique SQL
clear-all=Tout effacer
use=Utiliser
explain=Explain
top=Épingler
untop=Détacher
copy=Copier
delete=Supprimer
today=Aujourd'hui
yestoday=Hier
delete-sql-log-confirm-text=Êtes-vous sûr de vouloir supprimer l'historique SQL ?
copy-to-clipboard=Copié dans le presse-papiers
save-success-text=Enregistrement réussi
delete-success-text=Suppression réussie
data-has-changed=Les données ont été modifiées. Êtes-vous sûr de vouloir fermer la page ?
not-save-and-close=Ne pas enregistrer, fermer
cancel=Annuler la fermeture
table-export-as=Exporter la table Alt+E
export-as-sql-success-text=Exportation réussie. Ouvrir le fichier ?
new-query=Nouvelle fenêtre de requête (F7)
save-current=Enregistrer l'onglet courant (Ctrl+S)
save-all=Enregistrer tout (Ctrl+Maj+S)
first-page=Première page
prev-page=Page précédente
next-page=Page suivante
last-page=Dernière page
save-if-data-has-changed=Les données ont été modifiées. Enregistrer avant de fermer ?
unsort=Annuler le tri
tab-close-this=Fermer cet onglet
tab-close-others=Fermer les autres
tab-close-left=Fermer tous à gauche
tab-close-right=Fermer tous à droite
perf-analysis=Analyse des performances
perf-analysis-reports=Rapports d'analyse
store-analysis=Analyse du stockage
db-params=Paramètres de la BDD
not-select-sql=Seules les instructions SELECT sont prises en charge
open-sql-log=Ouvrir l'historique SQL pour l'analyse des performances (Ctrl+L)
add-sql-analysis=Saisissez une requête SQL pour l'analyse des performances (Ctrl+I)
sql-log-not-found=Historique SQL introuvable, vérifiez s'il n'a pas été supprimé
original-sql=Requête SQL d'origine
where-clause-analysis=Analyse de la clause WHERE
order-clause-analysis=Analyse de la clause ORDER
covering-index-analysis=Analyse des index couvrants
table-join-analysis=Analyse des JOIN
in-table=Table de données
where-use-column=La clause WHERE utilise des colonnes
order-use-column=La clause ORDER utilise des colonnes
covering-index-column=Les clauses WHERE et ORDER utilisent des colonnes
where-use-index=La clause WHERE utilise un index
order-use-index=La clause ORDER utilise un index
use-covering-index=Utilise un index couvrant
create-index-for-performance=Recommandation : créez un index pour les colonnes suivantes afin d'améliorer les performances des requêtes
hint-index-for-performance=Astuce : l'index {hintIndexName} couvre déjà les colonnes : {hintIndexColumns}
create-covering-index-for-performance=Recommandation : créez un index couvrant pour les colonnes suivantes afin d'améliorer les performances des requêtes
create-index-togeger=Créer un index (ensemble)
create-index-individ=Créer des index (séparément)
create-covering-index=Créer un index couvrant
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Le pseudo-code ci-dessous montre le processus d'exécution de l'optimiseur de requêtes
cycle-count=Statistiques des cycles
optimize-cycle-count=Astuce : modifier l'ordre de jointure des tables JOIN peut optimiser et réduire le nombre de cycles.
general-settings=Paramètres généraux
about=À propos
language-setting=Paramètres de langue de l'interface
change-language-restart-text=Pour changer la langue, vous devez redémarrer le logiciel.
close-and-restart=Fermer et redémarrer
do-not-restart=Ne pas redémarrer
about-us=À propos de nous
about-us-description=CuteSqlite est un logiciel open source développé par l'auteur Xuehan Qin.
version-info=Version
version-info-description=CuteSqlite v0.2.2 beta (64 bits)
feedback=Commentaires
feedback-description=Si vous avez des problèmes avec le logiciel, ou si vous avez des idées et suggestions pour cette application, veuillez remplir le formulaire ci-dessous pour nous faire part de vos commentaires.
content-text=Contenu
license=Licence Apache Version 2.0
select-columns-analysis=Analyse des colonnes SELECT
select-use-column=L'instruction SELECT utilise les colonnes suivantes
select-use-column-count=Nombre de colonnes
select-use-column-advice=Recommandation : l'instruction SELECT sélectionne plus de {maxColumns} colonnes. Réduire le nombre de colonnes peut améliorer les performances des requêtes.
select-use-column-tips=Astuce : réduire le nombre de colonnes peut améliorer les performances des requêtes.
sql-perf-report-prefix=rapport-perf-sql-
store-analysis-prefix=Analyse du stockage :
analysis-sql=Analyse SQL
open-perf-report=Ouvrir le rapport Alt+O
drop-perf-report=Supprimer le rapport Alt+Suppr
drop-perf-report-confirm-text=Confirmer la suppression du rapport ?
store-analysis-text=Vous permet d'analyser la capacité de stockage de la base de données, des tables et des index
table-store-analysis=Table - {tblName}
index-store-analysis=Index - {idxName} - Table : {tblName}
db-disk-used-title=Rapport d'utilisation de l'espace disque, chemin de la BDD : {dbPath}
page-size-text=Taille de page (octets)
page-size-tips=Taille de page (octets)
file-bytes-text=Taille du fichier (octets)
file-bytes-tips=Taille du fichier (octets)
file-pgcnt-text=Nombre de pages dans tout le fichier (mesuré)
file-pgcnt-tips=Nombre de pages dans tout le fichier (mesuré)
file-pgcnt2-text=Nombre de pages dans tout le fichier (calculé)
file-pgcnt2-tips=Nombre de pages dans tout le fichier (calculé)
inuse-pgcnt-text=Nombre de pages stockant des données (utilisées)
inuse-pgcnt-tips=Nombre de pages stockant des données (utilisées)
free-pgcnt2-text=Nombre de pages sans données (par en-tête)
free-pgcnt2-tips=Nombre de pages sans données (par en-tête)
free-pgcnt-text=Nombre de pages sans données (calculé)
free-pgcnt-tips=Nombre de pages sans données (calculé)
av-pgcnt-text=Nombre de pages automatiquement nettoyées
av-pgcnt-tips=Nombre de pages automatiquement nettoyées
ntable-text=Nombre de tables dans la BDD
ntable-tips=Nombre de tables dans la BDD
nindex-text=Nombre d'index
nindex-tips=Nombre d'index
nmanindex-text=Nombre d'index définis
nmanindex-tips=Nombre d'index définis
nautoindex-text=Nombre d'index implicites (auto-incrément)
nautoindex-tips=Nombre d'index implicites (auto-incrément)
user-payload-text=Octets de charge utile utilisateur stockés
user-payload-tips=Octets de charge utile utilisateur stockés
all-tbl-entrycnt-title=Nombre total d'enregistrements dans toutes les tables
all-tbl-idx-pagecnt-title=Nombre de pages de toutes les tables et de leurs index
sperate-tbl-idx-pagecnt-title=Nombre de pages de toutes les tables et index (calcul séparé)
all-tbl-idx-report-title=Toutes les tables et index
total-pages-percent-text=Pourcentage du total des pages de la BDD
total-pages-percent-tips=Pourcentage du total des pages de la BDD
nentry-text=Nombre d'enregistrements
nentry-tips=Nombre d'enregistrements
storage-text=Octets de stockage utilisés
storage-tips=Octets de stockage utilisés
compressed-size-text=Octets utilisés après compression
compressed-size-tips=Octets utilisés après compression
payload-text=Octets de charge utile
payload-tips=Octets de charge utile
total-meta-text=Octets de métadonnées
total-meta-tips=Octets de métadonnées
depth-text=Profondeur de l'arbre B
depth-tips=Profondeur de l'arbre B
avg-payload-text=Charge utile moyenne par enregistrement
avg-payload-tips=Charge utile moyenne par enregistrement
avg-unused-text=Moyenne d'octets inutilisés par enregistrement
avg-unused-tips=Moyenne d'octets inutilisés par enregistrement
avg-meta-text=Métadonnées moyennes par enregistrement
avg-meta-tips=Métadonnées moyennes par enregistrement
avg-fanout-text=Facteur de branchement moyen
avg-fanout-tips=Facteur de branchement moyen
gap-cnt-text=Pages non contiguës
gap-cnt-tips=Pages non contiguës
mx-payload-text=Charge utile maximale par enregistrement
mx-payload-tips=Charge utile maximale par enregistrement
ovfl-cnt-text=Nombre d'enregistrements de débordement utilisés
ovfl-cnt-tips=Nombre d'enregistrements de débordement utilisés
int-pages-text=Nombre de pages d'index utilisées
int-pages-tips=Nombre de pages d'index utilisées
leaf-pages-text=Nombre de pages de feuilles utilisées
leaf-pages-tips=Nombre de pages de feuilles utilisées
ovfl-pages-text=Nombre de pages de débordement utilisées
ovfl-pages-tips=Nombre de pages de débordement utilisées
total-pages-text=Nombre total de pages utilisées
total-pages-tips=Nombre total de pages utilisées
int-unused-text=Octets inutilisés sur les pages d'index
int-unused-tips=Octets inutilisés sur les pages d'index
leaf-unused-text=Octets inutilisés sur les pages de feuilles
leaf-unused-tips=Octets inutilisés sur les pages de feuilles
ovfl-unused-text=Octets inutilisés sur les pages de débordement
ovfl-unused-tips=Octets inutilisés sur les pages de débordement
total-unused-text=Octets inutilisés sur toutes les pages
total-unused-tips=Octets inutilisés sur toutes les pages
all-table-report-title=Toutes les tables (sans index)
all-indices-report-title=Tous les index (sans tables)
tbl-and-all-idx-report-title=Table {tblName} et tous ses index
tbl-only-report-title=Table {tblName} (sans index)
idx-only-report-title=Tous les index de la table {tblName}
tbl-report-title=Table {tblName}
idx-report-title=Index {idxName} de la table {tblName}
props-tbl-only-report-title=Analyse du stockage de la table {tblName}
props-idx-props-only-report-title=Tous les index de la table {tblName}
db-pragma-params=Paramètres PRAGMA
db-quick-config-params=Paramètres de configuration rapide
select-pragma=PRAGMA
pragma-analysis-limit-tips=Interroge ou modifie la limite des paramètres d'analyse (ANALYZE). Il s'agit du nombre approximatif de lignes que la commande ANALYZE examine dans chaque index.
pragma-application-id-tips=Utilisé pour interroger ou définir l'entier signé 32 bits "Application ID" en big-endian situé à l'offset 68 dans l'en-tête de la base de données.
pragma-auto-vacuum-tips=Interroge ou définit l'état du nettoyage automatique (auto-vacuum) dans la base de données.
pragma-automatic-index-tips=Interroge, active ou désactive la fonction d'indexation automatique.
pragma-busy-timeout-tips=Interroge ou modifie le paramètre de délai d'attente (busy timeout).
pragma-cache-size-tips=Interroge ou modifie le nombre maximal de pages de disque de la base de données que SQLite recommande de conserver en mémoire pour chaque fichier de base de données ouvert.
pragma-cache-spill-tips=Active ou désactive la capacité du programme de pagination à vider les pages de cache modifiées dans le fichier de base de données au milieu d'une transaction.
pragma-case-sensitive-like-tips=Le comportement par défaut de l'opérateur LIKE ignore la casse des caractères ASCII. Par défaut, 'a' LIKE 'A' est donc vrai.
pragma-cell-size-check-tips=Active ou désactive des vérifications de cohérence supplémentaires lors de la lecture des pages de l'arbre B de la base de données à partir du disque. Lorsque la vérification de la taille des cellules est activée, la corruption de la base de données peut être détectée plus tôt et a moins de chances de se "propager".
pragma-checkpoint-fullfsync-tips=Interroge ou modifie le flag fullfsync pour les opérations de point de contrôle (checkpoint). Si ce flag est activé, la méthode de synchronisation F_FULLFSYNC sera utilisée lors des opérations de point de contrôle sur les systèmes qui la prennent en charge. La valeur par défaut du flag CHECKPOINT_FULLFSYNC est OFF. Seul Mac OS-X prend en charge F_FULLFSYNC.
pragma-collation-list-tips=Retourne la liste des séquences de collationnement définies pour la connexion de base de données actuelle.
pragma-compile-options-tips=Retourne les noms des options de compilation utilisées lors de la construction de SQLite, une option par ligne.
pragma-count-changes-tips=Interroge ou modifie le flag de comptage des modifications (count changes). Normalement, lorsque le flag count-changes n'est pas défini, les instructions INSERT, UPDATE et DELETE ne renvoient pas de données.
pragma-data-store-directory-tips=Interroge ou modifie la valeur de la variable globale sqlite3_data_directory, utilisée par le backend de l'interface système Windows pour déterminer l'emplacement de stockage des fichiers de base de données spécifiés avec un chemin relatif.
pragma-data-version-tips=Indique que le fichier de base de données a été modifié. Les programmes interactifs qui stockent le contenu de la base de données en mémoire ou l'affichent à l'écran peuvent utiliser la commande PRAGMA data_version pour déterminer s'ils doivent actualiser et recharger la mémoire ou mettre à jour l'affichage.
pragma-default-cache-size-tips=Interroge ou définit le nombre maximal recommandé de pages de cache disque qui seront allouées pour chaque fichier de base de données ouvert.
pragma-defer-foreign-keys-tips=Ordonne de différer toutes les contraintes de clé étrangère jusqu'à la validation de la transaction la plus externe.
pragma-empty-result-callbacks-tips=Interroge ou modifie le flag de rappel de résultat vide.
pragma-encoding-tips=Encodage textuel utilisé par la base de données principale : 'UTF-8', 'UTF-16le' (UTF-16 little-endian) ou 'UTF-16be' (UTF-16 big-endian).
pragma-foreign-key-check-tips=Vérifie la base de données ou la table pour d'éventuelles violations des contraintes de clé étrangère.
pragma-foreign-keys-tips=Interroge, active ou désactive l'application des contraintes de clé étrangère.
pragma-freelist-count-tips=Retourne le nombre de pages inutilisées dans le fichier de base de données.
pragma-full-column-names-tips=Interroge ou modifie le flag full_column_names.
pragma-fullfsync-tips=Interroge ou modifie le flag fullfsync. Ce flag détermine si la méthode de synchronisation F_FULLFSYNC sera utilisée sur les systèmes qui la prennent en charge. La valeur par défaut de fullfsync est OFF. Seul Mac OS X prend en charge F_FULLFSYNC.
pragma-hard-heap-limit-tips=Définit une limite sur la quantité de mémoire de tas (heap) pour toutes les connexions à la base de données dans un seul processus.
pragma-ignore-check-constraints-tips=Active ou désactive l'application des contraintes CHECK. Le paramètre par défaut est OFF, ce qui signifie que les contraintes CHECK sont appliquées par défaut.
pragma-incremental-vacuum-tips=Provoque la suppression d'un maximum de N pages de la liste des pages libres (freelist).
pragma-integrity-check-tips=Effectue une vérification de bas niveau du formatage et de la cohérence de la base de données.
pragma-journal-mode-tips=Interroge ou définit le mode journal (journal mode) pour la base de données associée à la connexion actuelle.
pragma-journal-size-limit-tips=Limite la taille des fichiers de journal de restauration (rollback journal) et WAL conservés dans le système de fichiers après une transaction ou un point de contrôle.
pragma-legacy-alter-table-tips=Définit ou interroge la valeur du flag legacy_alter_table.
pragma-locking-mode-tips=Définit ou interroge le mode de verrouillage (locking mode) de la connexion à la base de données. Les modes sont NORMAL ou EXCLUSIVE.
pragma-max-page-count-tips=Interroge ou définit le nombre maximal de pages dans le fichier de base de données.
pragma-mmap-size-tips=Interroge ou modifie le nombre maximal d'octets réservés pour les entrées-sorties par projection en mémoire (memory-mapped I/O) pour une seule base de données.
pragma-module-list-tips=Retourne la liste des modules de tables virtuelles enregistrés auprès de la connexion à la base de données.
pragma-optimize-tips=Tente d'optimiser la base de données.
pragma-page-count-tips=Retourne le nombre total de pages dans le fichier de base de données.
pragma-page-size-tips=Interroge ou définit la taille de page de la base de données. La taille de page doit être une puissance de deux comprise entre 512 et 65536.
pragma-parser-trace-tips=Active la trace de l'analyseur syntaxique SQL utilisé en interne par SQLITE. N'agit que si compilé avec SQLITE_DEBUG.
pragma-query-only-tips=Empêche la modification des données dans le fichier de base de données. Lorsque cette option est activée, toute tentative de CREATE, UPDATE, DROP, INSERT ou UPDATE entraînera une erreur SQLITE_READONLY.
pragma-quick-check-tips=Effectue une vérification de bas niveau du formatage et de la cohérence de la base de données, en ignorant les vérifications de cohérence UNIQUE et des index.
pragma-read-uncommitted-tips=Interroge, active ou désactive le niveau d'isolation READ UNCOMMITTED.
pragma-recursive-triggers-tips=Interroge, active ou désactive l'exécution récursive des déclencheurs.
pragma-reverse-unordered-selects-tips=Lorsqu'elle est activée, cette pragma fait que de nombreuses requêtes SELECT sans clause ORDER BY renvoient les résultats dans un ordre généralement inverse.
pragma-schema-version-tips=Obtient ou définit la valeur entière schema_version à l'offset 40 dans l'en-tête de la base de données.
pragma-secure-delete-tips=Interroge ou modifie le paramètre de suppression sécurisée (secure-delete).
pragma-short-column-names-tips=Interroge ou modifie le flag de noms de colonnes courts.
pragma-soft-heap-limit-tips=Limite la quantité de mémoire de tas utilisée par toutes les connexions à la base de données dans un seul processus.
pragma-stats-tips=Retourne des informations auxiliaires sur les tables et les index.
pragma-synchronous-tips=Interroge ou modifie le paramètre du flag "synchronous".
pragma-temp-store-tips=Interroge ou modifie la valeur de la variable globale sqlite3_temp_directory, utilisée par de nombreux backends d'interface système pour déterminer l'emplacement de stockage des tables et index temporaires.
pragma-threads-tips=Nombre de threads auxiliaires démarrés par une instruction préparée (prepared statement) pour aider à l'exécution de la requête.
pragma-trusted-schema-tips=Autorise ou non l'exécution de fonctions SQL et de tables virtuelles non vérifiées dans le schéma. Détermine si les vues, les déclencheurs ou les expressions de schéma (telles que les contraintes CHECK, les clauses DEFAULT, les colonnes générées, les index sur expressions et/ou les index partiels) sont autorisés à exécuter des fonctions SQL et des tables virtuelles non vérifiées.
pragma-user-version-tips=Obtient ou définit la valeur entière user_version à l'offset 60 dans l'en-tête de la base de données.
pragma-vdbe-addoptrace-tips=Les codes d'opération VDBE complets sont affichés lors de la génération du code. Fonctionne si SQLite est compilé avec l'option SQLITE_DEBUG et si vdbe_debug est activé.
pragma-vdbe-debug-tips=Active le débogage VDBE. Fonctionne si SQLite est compilé avec l'option SQLITE_DEBUG.
pragma-vdbe-listing-tips=Affiche la liste complète des codes d'opération de la machine virtuelle sur la sortie standard. Fonctionne si SQLite est compilé avec l'option SQLITE_DEBUG et si vdbe_debug est activé.
pragma-vdbe-trace-tips=Affiche les codes d'opération de la machine virtuelle sur la sortie standard pendant le calcul. Fonctionne si SQLite est compilé avec l'option SQLITE_DEBUG et si vdbe_debug est activé.
pragma-wal-autocheckpoint-tips=Interroge ou définit l'intervalle de point de contrôle automatique (auto-checkpoint) pour le journal d'écriture anticipée (write-ahead log).
pragma-wal-checkpoint-tips=Provoque le transfert du contenu du journal d'écriture anticipée (write-ahead log) pour la base de données X dans la connexion D vers le fichier de base de données, et la réinitialisation du journal.
pragma-writable-schema-tips=Permet de modifier la table sqlite_schema à l'aide d'instructions UPDATE, INSERT et DELETE ordinaires. Attention : l'abus de cette pragma peut facilement entraîner la corruption du fichier de base de données.
pragma-save-confirm=L'instruction PRAGMA affectera le fonctionnement de la base de données. Confirmer l'exécution de l'instruction suivante ?
confirm-exec-text=Confirmer et exécuter